{
    "aria properties": [{
        "term": "aria-activedescendant",
        "definition": "Identifies the currently active descendant of a composite widget."
    }, {
        "term": "aria-atomic",
        "definition": "Indicates whether assistive technologies will present all, or only parts of, the changed region based on the change notifications defined by the aria-relevant attribute. See related: aria-relevant."
    }, {
        "term": "aria-autocomplete",
        "definitiion": "Indicates whether user input completion suggestions are provided."
    }, {
        "term": "aria-busy (state)",
        "definition": "Indicates whether an element (& its subtree) are currently being updated."
    }, {
        "term": "aria-checked (state)",
        "definition": "Indicates the current checked state of checkboxes, radio buttons, and other widgets. See related aria-pressed and aria-selected."
    }, {
        "term": "aria-controls",
        "definition": "Identifies the element (or elements) whose contents or presence are controlled by the current element. See related aria-owns."
    }, {
        "term": "aria-describedby",
        "definition": "Identifies the element (or elements) that describes the object. See related aria-labelledby."
    }, {
        "term": "aria-disabled (state)",
        "definition": "Indicates that the element is perceivable but disabled, so it is not editable or otherwise operable. See related aria-hidden and aria-readonly."
    }, {
        "term": "aria-dropeffect",
        "definition": "Indicates what functions can be performed when the dragged object is released on the drop target. This allows assistive technologies to convey the possible drag options available to users, including whether a pop-up menu of choices is provided by the application. Typically, drop effect functions can only be provided once an object has been grabbed for a drag operation as the drop effect functions available are dependent on the object being dragged."
    }, {
        "term": "aria-expanded (state)",
        "definition": "Indicates whether the element, or another grouping element it controls, is currently expanded or collapsed."
    }, {
        "term": "aria-flowto",
        "definition": "Identifies the next element (or elements) in an alternate reading order of content which, at the user's discretion, allows assistive technology to override the general default of reading in document source order."
    }, {
        "term": "aria-grabbed (state)",
        "definition": "Indicates an element's \"grabbed\" state in a drag-and-drop operation."
    }, {
        "term": "aria-haspopup",
        "definition": "Indicates that the element has a popup context menu or sub-level menu."
    }, {
        "term": "aria-hidden (state)",
        "definition": "Indicates that the element and all of its descendants are not visible or perceivable to any user as implemented by the author. See related aria-disabled."
    }, {
        "term": "aria-invalid (state)",
        "definition": "Indicates the entered value does not conform to the format expected by the application."
    }, {
        "term": "aria-label",
        "definition": "Defines a string value that labels the current element. See related aria-labelledby."
    }, {
        "term": "aria-labelledby",
        "definition": "Identifies the element (or elements) that labels the current element. See related aria-label and aria-describedby."
    }, {
        "term": "aria-level",
        "definition": "Defines the hierarchical level of an element within a structure."
    }, {
        "term": "aria-live",
        "definition": "Indicates that an element will be updated, and describes the types of updates the user agents, assistive technologies, and user can expect from the live region."
    }, {
        "term": "aria-multiline",
        "definition": "Indicates whether a text box accepts multiple lines of input or only a single line."
    }, {
        "term": "aria-multiselectable",
        "definition": "Indicates that the user may select more than one item from the current selectable descendants."
    }, {
        "term": "aria-orientation",
        "definition": "Indicates whether the element and orientation is horizontal or vertical."
    }, {
        "term": "aria-owns",
        "definition": "Identifies an element (or elements) in order to define a visual, functional, or contextual parent/child relationship between DOM elements where the DOM hierarchy cannot be used to represent the relationship. See related aria-controls."
    }, {
        "term": "aria-posinset",
        "definition": "Defines an element's number or position in the current set of listitems or treeitems. Not required if all elements in the set are present in the DOM. See related aria-setsize."
    }, {
        "term": "aria-pressed (state)",
        "definition": "Indicates the current \"pressed\" state of toggle buttons. See related aria-checked and aria-selected."
    }, {
        "term": "aria-readonly",
        "definition": "Indicates that the element is not editable, but is otherwise operable. See related aria-disabled."
    }, {
        "term": "aria-relevant",
        "definition": "Indicates what user agent change notifications (additions, removals, etc.) assistive technologies will receive within a live region. See related aria-atomic."
    }, {
        "term": "aria-required",
        "definition": "Indicates that user input is required on the element before a form may be submitted."
    }, {
        "term": "aria-selected (state)",
        "definition": "Indicates the current \"selected\" state of various widgets. See related aria-checked and aria-pressed."
    }, {
        "term": "aria-setsize",
        "definition": "Defines the number of items in the current set of listitems or treeitems. Not required if all elements in the set are present in the DOM. See related aria-posinset."
    }, {
        "term": "aria-sort",
        "definition": "Indicates if items in a table or grid are sorted in ascending or descending order."
    }, {
        "term": "aria-valuemax",
        "definition": "Defines the maximum allowed value for a range widget."
    }, {
        "term": "aria-valuemin",
        "definition": "Defines the minimum allowed value for a range widget."
    }, {
        "term": "aria-valuenow",
        "definition": "Defines the current value for a range widget. See related aria-valuetext."
    }, {
        "term": "aria-valuetext",
        "definition": "Defines the human readable text alternative of aria-valuenow for a range widget."
    }]
}